Repository: shopsys/demoshop
Catalog: src/Shopsys/ShopBundle/Resources/translations/validators.*.po
Languages: de

source: City name cannot be longer than {{ limit }} characters
de: Der Name der Stadt darf nicht länger als {{ limit }}} Zeichen sein

source: Company name cannot be longer than {{ limit }} characters
de: Der Firmenname darf nicht länger als {{{ limit }}} Zeichen sein

source: Discount percentage needs to be valid number with range between 0 and 100.
de: Der Rabattprozentsatz muss eine gültige Zahl mit einem Bereich zwischen 0 und 100 sein.

source: Discount percentage should be {{ limit }} or less.
de: Der Rabattprozentsatz sollte {{ limit }}} oder weniger sein.

source: Discount percentage should be {{ limit }} or more.
de: Der Rabattprozentsatz sollte {{ limit }}} oder mehr sein.

source: Email cannot be longer then {{ limit }} characters
de: E-Mails dürfen nicht länger als {{ limit }}} Zeichen sein

source: First name cannot be longer then {{ limit }} characters
de: Vorname darf nicht länger als {{ limit }}} Zeichen sein

source: First name of contact person cannot be longer then {{ limit }} characters
de: Der Vorname der Kontaktperson darf nicht länger als {{ limit }}} Zeichen sein

source: Identification number cannot be longer then {{ limit }} characters
de: Die Identifikationsnummer darf nicht länger als {{ limit }}} Zeichen sein

source: Last name cannot be longer than {{ limit }} characters
de: Der Nachname darf nicht länger als {{{ limit }}} Zeichen sein

source: Last name of contact person cannot be longer than {{ limit }} characters
de: Der Nachname der Kontaktperson darf nicht länger als {{{ limit }}} Zeichen sein

source: Password cannot be longer then {{ limit }} characters
de: Das Passwort darf nicht länger als {{ limit }}} Zeichen sein

source: Password cannot be same as e-mail
de: Das Passwort darf nicht mit der E-Mail übereinstimmen

source: Password cannot be same as part of e-mail before at sign
de: Das Passwort kann nicht mit dem Teil der E-Mail vor der At-Zeichen identisch sein

source: Passwords do not match
de: Passwörter stimmen nicht überein

source: Please check the correctness of all data filled.
de: Bitte überprüfen Sie die Richtigkeit aller ausgefüllten Daten.

source: Please choose a valid combination of transport and payment
de: Bitte wählen Sie eine gültige Kombination aus Transport und Zahlung

source: Please choose country
de: Bitte wählen Sie den Staat aus

source: Please choose payment type
de: Bitte wählen Sie die Zahlungsart aus

source: Please choose shipping type
de: Bitte wählen Sie die Versandart aus

source: Please enter city
de: Bitte geben Sie Ihre Stadt ein

source: Please enter company name
de: Bitte geben Sie den Firmennamen ein

source: Please enter content
de: Bitte geben Sie den Inhalt ein

source: Please enter date of creation
de: Bitte geben Sie das Erstellungsdatum ein

source: Please enter discount percentage
de: Bitte geben Sie den Rabattprozentsatz ein

source: Please enter e-mail
de: Bitte geben Sie Ihre E-Mail-Adresse ein

source: Please enter first name
de: Bitte Vorname eingeben

source: Please enter first name of contact person
de: Bitte geben Sie den Vornamen der Kontaktperson ein

source: Please enter full name
de: Bitte geben Sie den vollständigen Namen ein

source: Please enter identification number
de: Bitte geben Sie die Identifikationsnummer ein

source: Please enter last name
de: Bitte geben Sie den Nachnamen ein

source: Please enter last name of contact person
de: Bitte geben Sie den Nachnamen der Kontaktperson ein

source: Please enter password
de: Bitte Passwort eingeben

source: Please enter price in correct format (positive number with decimal separator)
de: Bitte geben Sie den Preis im richtigen Format ein (positive Zahl mit Dezimaltrennzeichen)

source: Please enter quantity
de: Bitte geben Sie die Menge ein

source: Please enter street
de: Bitte geben Sie die Straße ein

source: Please enter telephone number
de: Bitte geben Sie die Telefonnummer ein

source: Please enter valid e-mail
de: Bitte geben Sie eine gültige E-Mail Adresse ein

source: Please enter valid quantity
de: Bitte geben Sie eine gültige Menge ein

source: Please enter zip code
de: Bitte geben Sie die Postleitzahl ein

source: Price must be greater or equal to zero
de: Der Preis muss größer als Null oder gleich Null sein

source: Quantity must be greater than {{ compared_value }}
de: Die Menge muss größer als {{Vergleichswert }}} sein

source: Street name cannot be longer than {{ limit }} characters
de: Der Straßenname darf nicht länger als {{ limit }}} Zeichen sein

source: Tax number cannot be longer than {{ limit }} characters
de: Die Steuernummer darf nicht länger als {{{ limit }}} Zeichen sein

source: Telephone number cannot be longer than {{ limit }} characters
de: Die Telefonnummer darf nicht länger als {{{ limit }}} Zeichen sein

source: This e-mail is already registered
de: Diese E-Mail ist bereits registriert

source: You have to agree with privacy policy
de: Sie müssen mit der Datenschutzerklärung einverstanden sein

source: You have to agree with terms and conditions and privacy policy
de: Sie müssen mit den Allgemeinen Geschäftsbedingungen und der Datenschutzerklärung einverstanden sein

source: Zip code cannot be longer than {{ limit }} characters
de: Die Postleitzahl darf nicht länger als {{{ limit }}} Zeichen sein
